arduino/Arduino/hardware/msp432/boards.txt
##############################################################
MSP-EXP432P401R.name=LaunchPad w/ msp432 EMT (48MHz)
MSP-EXP432P401R.upload.maximum_size=262144
MSP-EXP432P401R.upload.maximum_ram_size=65536
MSP-EXP432P401R.build.mcu=cortex-m4f
MSP-EXP432P401R.build.f_cpu=48000000L
MSP-EXP432P401R.build.core=msp432
MSP-EXP432P401R.build.variant=MSP_EXP432P401R
MSP-EXP432P401R.build.hardware=MSP_EXP432P401R
MSP-EXP432P401R.ldscript=MSP432P401R.lds
